In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [6]:
df.groupby(["genero"]).mean()

         edad          cm    Q1        Q2
genero
F       11.25  121.250000  5.75  8.000000
M       12.00  131.666667  9.00  8.666667

In [7]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])


print(df.loc[['Ana'],['cm']])

      cm
Ana  115

In [8]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [7]:
df[(df["edad"].conve

        edad   cm pais genero  Q1   Q2
Daniel    14  155   mx      M NaN  8.0

In [14]:
df.tail(1)

          edad   cm pais genero   Q1   Q2
Gabriela    12  125   ch      F  3.0  9.0

In [18]:
pd.na

AttributeError: module 'pandas' has no attribute 'na'

In [19]:
np.nan

nan

In [21]:
pd.NA | False

In [22]:
pd.Series([10,8,5,0]) - pd.Series([0,1,6,12])

0    10
1     7
2    -1
3   -12
dtype: int64

In [12]:
np.array([10,8,5,0]) * np.array([0,1,6,12])

array([ 0,  8, 30,  0])

In [24]:
df.dtypes

edad        int64
cm          int64
pais       object
genero     object
Q1        float64
Q2        float64
dtype: object

In [10]:
df.convert_dtypes(["edad"]).dtypes

edad       Int64
cm         Int64
pais      string
genero    string
Q1         Int64
Q2         Int64
dtype: object

In [33]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])


print(df.query("(edad >= 12) & (cm < 130) & (Q1 > 5)")['Q2'])

Erika    8.0
Name: Q2, dtype: float64

In [35]:
[10,8,5,0] + [0,1,6,12]

[10, 8, 5, 0, 0, 1, 6, 12]

In [6]:
df.describe(include="all")

             edad          cm pais genero         Q1        Q2
count    7.000000    7.000000    7      7   6.000000  7.000000
unique        NaN         NaN    3      2        NaN       NaN
top           NaN         NaN   mx      F        NaN       NaN
freq          NaN         NaN    3      4        NaN       NaN
mean    11.571429  125.714286  NaN    NaN   6.833333  8.285714
std      1.718249   14.556949  NaN    NaN   2.483277  0.755929
min      9.000000  110.000000  NaN    NaN   3.000000  7.000000
25%     10.500000  117.500000  NaN    NaN   5.500000  8.000000
50%     12.000000  125.000000  NaN    NaN   7.500000  8.000000
75%     12.500000  127.500000  NaN    NaN   8.000000  9.000000
max     14.000000  155.000000  NaN    NaN  10.000000  9.000000

In [8]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

print(df.iloc[[4],[2]])

      pais
Erika   mx

In [9]:
pd.Series([10,8,5,0]) - pd.Series([0,1,6,12])

0    10
1     7
2    -1
3   -12
dtype: int64

In [11]:
pd.NA | False

In [13]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])


print(df['edad'] >= 12)

Ana         False
Benito      False
Camilo       True
Daniel       True
Erika        True
Paola       False
Gabriela     True
Name: edad, dtype: bool

In [14]:
[10,8,5,0] + [0,1,6,12]

[10, 8, 5, 0, 0, 1, 6, 12]

In [17]:
df

          edad   cm pais genero    Q1   Q2
Ana         10  115   co      F   5.0  7.0
Benito       9  110   mx      M  10.0  9.0
Camilo      13  130   co      M   8.0  9.0
Daniel      14  155   mx      M   NaN  8.0
Erika       12  125   mx      F   7.0  8.0
Paola       11  120   ch      F   8.0  8.0
Gabriela    12  125   ch      F   3.0  9.0

In [19]:
df.group_by("M").mean()

AttributeError: 'DataFrame' object has no attribute 'group_by'

In [20]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [25]:
df.groupby(["genero"])["cm"].agg([np.mean, np.std])

              mean        std
genero
F       121.250000   4.787136
M       131.666667  22.546249

In [26]:
df2 = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [31]:
df.append(df2)

          edad   cm pais genero    Q1   Q2
Ana         10  115   co      F   5.0  7.0
Benito       9  110   mx      M  10.0  9.0
Camilo      13  130   co      M   8.0  9.0
Daniel      14  155   mx      M   NaN  8.0
Erika       12  125   mx      F   7.0  8.0
Paola       11  120   ch      F   8.0  8.0
Gabriela    12  125   ch      F   3.0  9.0
Ana         10  115   co      F   5.0  7.0
Benito       9  110   mx      M  10.0  9.0
Camilo      13  130   co      M   8.0  9.0
Daniel      14  155   mx      M   NaN  8.0
Erika       12  125   mx      F   7.0  8.0
Paola       11  120   ch      F   8.0  8.0
Gabriela    12  125   ch      F   3.0  9.0